
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Элементы.Способ.Видимость =Ложь
	Элементы.Адрес.Видимость = Способ=1;
	
	Элементы.Организация.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Организации");
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОсновнаяОрганизация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
 	ОрганизацияПриИзмененииНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура СпособПриИзменении(Элемент)
	Элементы.Адрес.Видимость = Способ=1;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	КДРО_Сервер.СохранитьНастройки(ЭтотОбъект)
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьИЗакрытьНаСервере(); 
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	Для каждого Имя из СтрРазделить("Способ,Токен,Адрес,ДанныеАвторизации", ",") Цикл
		Элементы[Имя].Доступность = ЗначениеЗаполнено(Организация);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, КДРО_Сервер.ПолучитьСохраненныеНастройки(Организация));
	Элементы.КлючРегистрации.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДанныеАвторизацииНаСервере()
	Поля = Новый Массив;
	Поля.Добавить(Организация.УникальныйИдентификатор());
	Поля.Добавить(Организация.ИНН);
	Поля.Добавить(Организация.Наименование);
	Поля.Добавить(ТекущаяДата());
	
	Текст=СтрСоединить(Поля,";");
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.Добавить(ПолучитьДвоичныеДанныеИзСтроки(Текст));
	Поля.Добавить(Base64Строка(Хеш.ХешСумма));
	
	КлючРегистрации = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(СтрСоединить(Поля,";")));
	Элементы.КлючРегистрации.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеАвторизации(Команда)
	ДанныеАвторизацииНаСервере();
КонецПроцедуры
