Функция СтруктураДанныхСохранения()
	Возврат Новый Структура("Адрес, Способ, Токен", "", 0, "");
КонецФункции  

Функция ИмяКлючаНастройки()
	Возврат "КонтрольДоставкиРассылкиОтчетов"	
КонецФункции

Функция ПолучитьСохраненныеНастройки(Организация) Экспорт
	Данные = СтруктураДанныхСохранения();
	УстановитьПривилегированныйРежим(Истина);
	СохраненныеДанные = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Организация, ИмяКлючаНастройки());
	Если ТипЗнч(СохраненныеДанные) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Данные, СохраненныеДанные)
	КонецЕсли;
    Возврат Данные
КонецФункции    

Процедура СохранитьНастройки(знач Форма) Экспорт
	Данные = СтруктураДанныхСохранения();
	ЗаполнитьЗначенияСвойств(Данные, Форма);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Форма.Организация, Данные, ИмяКлючаНастройки());
КонецПроцедуры


Функция ДоменOnCloud() Экспорт
	возврат "readrepot.hosts.cloud65.ru"
КонецФункции

Функция ПолучитьАдресСсылки(Период, Организация, ФизическоеЛицо) Экспорт
	Возврат КДРО_ПовтИсп.АдресСлужбы(Организация) + "/"
		+ Организация.УникальныйИдентификатор() + "/"
		+ Формат(Период, "ДФ=гггг") + "/"
		+ Формат(Период, "ДФ=М") + "/"
        + ФизическоеЛицо.УникальныйИдентификатор() + "/logo.png";
КонецФункции

