Функция СтруктураДанныхСохранения()
	Возврат Новый Структура("Адрес, Способ, Токен", "", 0, "");
КонецФункции  

Функция ИмяКлючаНастройки()
	Возврат "КонтрольДоставкиРассылкиОтчетов"	
КонецФункции

Функция ПолучитьСохраненныеНастройки(Организация) Экспорт
	Данные = СтруктураДанныхСохранения();
	УстановитьПривилегированныйРежим(Истина);
	СохраненныеДанные = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Организация, ИмяКлючаНастройки());
	Если ТипЗнч(СохраненныеДанные) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Данные, СохраненныеДанные)
	КонецЕсли;
    Возврат Данные
КонецФункции    

Процедура СохранитьНастройки(знач Форма) Экспорт
	Данные = СтруктураДанныхСохранения();
	ЗаполнитьЗначенияСвойств(Данные, Форма);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Форма.Организация, Данные, ИмяКлючаНастройки());
КонецПроцедуры


